{"config": [{"config": {"trainable": true, "input_dtype": "float32", "init": "glorot_uniform", "bias": true, "border_mode": "same", "nb_row": 3, "activity_regularizer": null, "batch_input_shape": [null, 32, 32, 3], "nb_col": 3, "activation": "linear", "W_regularizer": null, "W_constraint": null, "b_constraint": null, "nb_filter": 32, "name": "convolution2d_7", "dim_ordering": "tf", "b_regularizer": null, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"name": "activation_11", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "maxpooling2d_7", "strides": [2, 2], "border_mode": "valid", "dim_ordering": "tf", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_9", "trainable": true, "p": 0.15}, "class_name": "Dropout"}, {"config": {"trainable": true, "init": "glorot_uniform", "bias": true, "border_mode": "same", "nb_row": 3, "activity_regularizer": null, "nb_col": 3, "activation": "linear", "W_regularizer": null, "W_constraint": null, "b_constraint": null, "nb_filter": 64, "name": "convolution2d_8", "dim_ordering": "tf", "b_regularizer": null, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"name": "activation_12", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "maxpooling2d_8", "strides": [2, 2], "border_mode": "valid", "dim_ordering": "tf", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_10", "trainable": true, "p": 0.15}, "class_name": "Dropout"}, {"config": {"trainable": true, "init": "glorot_uniform", "bias": true, "border_mode": "same", "nb_row": 3, "activity_regularizer": null, "nb_col": 3, "activation": "linear", "W_regularizer": null, "W_constraint": null, "b_constraint": null, "nb_filter": 96, "name": "convolution2d_9", "dim_ordering": "tf", "b_regularizer": null, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"name": "activation_13", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "maxpooling2d_9", "strides": [2, 2], "border_mode": "valid", "dim_ordering": "tf", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_11", "trainable": true, "p": 0.15}, "class_name": "Dropout"}, {"config": {"name": "flatten_3", "trainable": true}, "class_name": "Flatten"}, {"config": {"trainable": true, "init": "glorot_uniform", "bias": true, "output_dim": 512, "activity_regularizer": null, "W_regularizer": null, "activation": "linear", "input_dim": null, "W_constraint": null, "b_constraint": null, "name": "dense_5", "b_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_14", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "dropout_12", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "init": "glorot_uniform", "bias": true, "output_dim": 10, "activity_regularizer": null, "W_regularizer": null, "activation": "linear", "input_dim": null, "W_constraint": null, "b_constraint": null, "name": "dense_6", "b_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_15", "trainable": true, "activation": "softmax"}, "class_name": "Activation"}], "keras_version": "1.1.1", "class_name": "Sequential"}